{
  "backend/main.mo": "Motoko canister implementing user profiles with access control and a public contact form storing messages retrievable only by admins.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and functionality of various frontend React components and configuration files.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, light/dark themes, and base element styling.",
  "frontend/index.html": "Base HTML document loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component rendering the LandingPage.",
  "frontend/src/components/landing/AboutSection.tsx": "About section displaying institute image and descriptive text in a two‑column layout.",
  "frontend/src/components/landing/ContactAddressMap.tsx": "Address and map component showing location details and an embedded Google Maps iframe.",
  "frontend/src/components/landing/ContactSection.tsx": "Contact form with validation, backend submission, success feedback, and a side‑by‑side address/map layout.",
  "frontend/src/components/landing/Footer.tsx": "Footer with current year, branding, and caffeine.ai attribution.",
  "frontend/src/components/landing/GallerySection.tsx": "Polished 9‑image training environment gallery with hover effects, overlays, and numbered badges.",
  "frontend/src/components/landing/HeroSection.tsx": "Renders the landing page hero with title, description, and a CTA button. Uses gradient styling and centers content responsively.",
  "frontend/src/components/landing/LandingSlider.tsx": "Implements an auto-advancing image slider with fade transitions, navigation arrows, and dot indicators. Uses responsive aspect ratios for full-width display.",
  "frontend/src/components/landing/landingTheme.ts": "Exports shared CSS class name constants for layout, typography, and card styles. Centralizes theme values for landing components.",
  "frontend/src/components/landing/Navbar.tsx": "Provides a responsive navbar with scroll-based styling, desktop and mobile menus, and navigation links. Includes a mobile toggle and CTA button.",
  "frontend/src/components/landing/ScrollToHash.tsx": "Listens for URL hash changes and smoothly scrolls to matching page sections. Runs once on load and updates on hashchange events.",
  "frontend/src/components/landing/ServicesSection.tsx": "Displays a grid of service cards with icons, titles, and descriptions. Includes hover effects and themed styling.",
  "frontend/src/components/landing/StudentReviewsSection.tsx": "Shows a grid of student review cards with quotes, photos, and locations. Uses shared styling from landing theme.",
  "frontend/src/components/landing/TrainingProgramsSection.tsx": "Renders a list of training programs in a styled grid using corporate-themed card components. Centers content within a padded section.",
  "frontend/src/components/landing/WhatsAppFloatingButton.tsx": "Adds a floating WhatsApp chat button linking to a preset number. Styled as a circular fixed-position action button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user’s identity using React Query. Reinitializes and invalidates queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication using AuthClient. Handles identity loading, login, logout, and state tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query mutation for submitting a contact message via an actor and invalidates the messages query on success.",
  "frontend/src/index.css": "Configures Tailwind layers and CSS variables for light/dark themes and sets global styles for body, html, and borders.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with InternetIdentityProvider and React Query's QueryClientProvider.",
  "frontend/src/pages/LandingPage.tsx": "Composes the landing page layout including navbar, slider, sections, footer, and utility components like ScrollToHash.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, radius, animations, and registering plugins like typography and container queries.",
  "project_state.json": "Project metadata describing current features, new requests, image requirements, and state version info."
}